<a href="https://colab.research.google.com/github/spasatel13/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/DS21_W1_D3_Join_%26_Reshape_Data_(DS21).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Join & Reshape Data

## Objectives

- Concatenate data using the pandas concat method
- Merge data using pandas merge
- Define the concept of tidy data and describe the format
- Transition between tidy and wide data formats with the `melt` and `pivot` methods

![The Anatomy of a DataFrame and a Series](https://miro.medium.com/max/700/1*ZSehcrMtBWN7_qCWq_HiSg.png)

## Concatenating Dataframes with Pandas

"Concatenate" is a fancy word for joining two things together. For example, we can concatenate two strings together using the `+` operator.

In [ ]:
'We can join/concatenate two strings together ' + 'using the "+" operator.'

'We can join/concatenate two strings together using the "+" operator.'

When we "concatenate" two dataframes we will "stick them together" either by rows or columns. Lets look at some simple examples:

In [ ]:
import pandas as pd

In [ ]:
df1 = pd.DataFrame({'a': [1,2,3,4], 'b': [4,5,6,7], 'c': [7,8,9,10]})

df2 = pd.DataFrame({'a': [6,4,8,7], 'b': [9,4,3,2], 'c': [1,6,2,9]})

In [ ]:
df1.head()

   a  b   c
0  1  4   7
1  2  5   8
2  3  6   9
3  4  7  10

In [ ]:
df2.head()

   a  b  c
0  6  9  1
1  4  4  6
2  8  3  2
3  7  2  9

### Concatenate by Rows 

concatenating by rows is the default behavior of `pd.concat()` This is often the most common form of concatenation.

In [ ]:
by_rows = pd.concat([df1, df2])

by_rows

   a  b   c
0  1  4   7
1  2  5   8
2  3  6   9
3  4  7  10
0  6  9   1
1  4  4   6
2  8  3   2
3  7  2   9

In [ ]:
by_rows.reset_index()

   index  a  b   c
0      0  1  4   7
1      1  2  5   8
2      2  3  6   9
3      3  4  7  10
4      0  6  9   1
5      1  4  4   6
6      2  8  3   2
7      3  7  2   9

### Concatenate by Columns

In [ ]:
by_cols = pd.concat([df1, df2], axis=1)

by_cols

   a  b   c  a  b  c
0  1  4   7  6  9  1
1  2  5   8  4  4  6
2  3  6   9  8  3  2
3  4  7  10  7  2  9

In [ ]:
by_cols['a']

   a  a
0  1  6
1  2  4
2  3  8
3  4  7

In [ ]:
# rename columns

by_cols.columns = ['a1', 'b1', 'c1', 'a2', 'b2', 'c2']

by_cols

   a1  b1  c1  a2  b2  c2
0   1   4   7   6   9   1
1   2   5   8   4   4   6
2   3   6   9   8   3   2
3   4   7  10   7   2   9

In [ ]:
by_cols['a1']

0    1
1    2
2    3
3    4
Name: a1, dtype: int64

When concatenating dataframes, it is done using the column headers and row index values to match rows up. If these don't match up, then `NaN` values will be added where matches can't be found.

In [ ]:
df3 = pd.DataFrame({'a': [4,3,2,1], 'b': [4,5,6,7], 'c': [7,8,9,10]})

df4 = pd.DataFrame({'a': [6,4,8,7,8], 'b': [9,4,3,2,1], 'd': [1,6,2,9,5]})

In [ ]:
df3.head()

   a  b   c
0  4  4   7
1  3  5   8
2  2  6   9
3  1  7  10

In [ ]:
df4.head()

   a  b  d
0  6  9  1
1  4  4  6
2  8  3  2
3  7  2  9
4  8  1  5

### Concatenate by rows when not all column headers match

In [ ]:
by_rows = pd.concat([df3, df4])

by_rows

   a  b     c    d
0  4  4   7.0  NaN
1  3  5   8.0  NaN
2  2  6   9.0  NaN
3  1  7  10.0  NaN
0  6  9   NaN  1.0
1  4  4   NaN  6.0
2  8  3   NaN  2.0
3  7  2   NaN  9.0
4  8  1   NaN  5.0

### Concatenate by columns when not all row indexes match

In [ ]:
by_cols = pd.concat([df3, df4], axis=1)

by_cols

     a    b     c  a  b  d
0  4.0  4.0   7.0  6  9  1
1  3.0  5.0   8.0  4  4  6
2  2.0  6.0   9.0  8  3  2
3  1.0  7.0  10.0  7  2  9
4  NaN  NaN   NaN  8  1  5

Whenever we are combining dataframes, if appropriate values cannot be found based on the rules of the method we are using, then missing values will be filled with `NaNs`.

### Let's Try It Out

We’ll work with a dataset of [3 Million Instacart Orders, Open Sourced](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2)!

The files that we will be working with are in a folder of CSVs, we need to load that folder of CSVs, explore the CSVs to make sure that we understand what we're working with, and where the important data lies, and then work to combine the dataframes together as necessary. 



Our goal is to reproduce this table which holds the first two orders for user id 1.

In [ ]:
from IPython.display import display, Image
url = 'https://cdn-images-1.medium.com/max/1600/1*vYGFQCafJtGBBX5mbl0xyw.png'
example = Image(url=url, width=600)

display(example)

In [ ]:
!wget https://www.dropbox.com/s/pofcl26lvoj6073/instacart-market-basket-analysis.zip

--2020-09-30 16:21:25--  https://www.dropbox.com/s/pofcl26lvoj6073/instacart-market-basket-analysis.zip
Resolving www.dropbox.com (www.dropbox.com)... 162.125.65.1, 2620:100:6021:1::a27d:4101
Connecting to www.dropbox.com (www.dropbox.com)|162.125.65.1|:443... connected.
HTTP request sent, awaiting response... 301 Moved Permanently
Location: /s/raw/pofcl26lvoj6073/instacart-market-basket-analysis.zip [following]
--2020-09-30 16:21:25--  https://www.dropbox.com/s/raw/pofcl26lvoj6073/instacart-market-basket-analysis.zip
Reusing existing connection to www.dropbox.com:443.
HTTP request sent, awaiting response... 302 Found
Location: https://ucaffda51fc2941f09eb26d21455.dl.dropboxusercontent.com/cd/0/inline/BAYAi-_2sbLgxjZgRspP1uuYeXDJQdJyOktmdtamPMT6mFtZm1dRcOaXyh3Ty-UNq25SxpnGP3m2_4D6Ik90PyZYpDZelzZfBtVdMZaKrrzL_98_OLOPhSrYsw4CBa77rGs/file# [following]
--2020-09-30 16:21:26--  https://ucaffda51fc2941f09eb26d21455.dl.dropboxusercontent.com/cd/0/inline/BAYAi-_2sbLgxjZgRspP1uuYeXDJQdJyOktmdtamPMT6mFtZm1dRcOaXyh3Ty-UNq25SxpnGP3m2_4D6Ik90PyZYpDZelzZfBtVdMZaKrrzL_98_OLOPhSrYsw4CBa77rGs/file
Resolving ucaffda51fc2941f09eb26d21455.dl.dropboxusercontent.com (ucaffda51fc2941f09eb26d21455.dl.dropboxusercontent.com)... 162.125.65.15, 2620:100:6021:15::a27d:410f
Connecting to ucaffda51fc2941f09eb26d21455.dl.dropboxusercontent.com (ucaffda51fc2941f09eb26d21455.dl.dropboxusercontent.com)|162.125.65.15|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: /cd/0/inline2/BAbgoErfa-ZUTyLhC5KAgsX0r2TXhIYuG3iTe7yUv0Wvwj-X-OsuyLkYJvTAkCMaBxG9rx8I7Ug0r5qMryfj9dhOFqZwTA4H_LN5xslXA5r02vWOUcvfYT7dy06VamSkh5YryEcXeN_48iqa_jG1ubJ9AG2qOUi9YWjDQD2-Oj9EQIEOTmdgUkEcpn3d2QBb9y4ho9Ed5Bj92kyQXz1_Q74KKXA9SX8CaeXLDXJCn66xxf8oE6o_z1fdNEJH6Gs6iIuRES6iyVpL3OdAKR-R3DnqOzN__1UafYvP1PElUeHfvY4u0f0YLwwmVuk0GrA-phBDQ3JxajbbYwItxVhnzK9mtQ-iMH8fhiKgaTq1i9IMlA/file [following]
--2020-09-30 16:21:26--  https://ucaffda51fc2941f09eb26d21455.dl.dropboxusercontent.com/cd/0/inline2/BAbgoErfa-ZUTyLhC5KAgsX0r2TXhIYuG3iTe7yUv0Wvwj-X-OsuyLkYJvTAkCMaBxG9rx8I7Ug0r5qMryfj9dhOFqZwTA4H_LN5xslXA5r02vWOUcvfYT7dy06VamSkh5YryEcXeN_48iqa_jG1ubJ9AG2qOUi9YWjDQD2-Oj9EQIEOTmdgUkEcpn3d2QBb9y4ho9Ed5Bj92kyQXz1_Q74KKXA9SX8CaeXLDXJCn66xxf8oE6o_z1fdNEJH6Gs6iIuRES6iyVpL3OdAKR-R3DnqOzN__1UafYvP1PElUeHfvY4u0f0YLwwmVuk0GrA-phBDQ3JxajbbYwItxVhnzK9mtQ-iMH8fhiKgaTq1i9IMlA/file
Reusing existing connection to ucaffda51fc2941f09eb26d21455.dl.dropboxusercontent.com:443.
HTTP request sent, awaiting response... 200 OK
Length: 205616541 (196M) [application/zip]
Saving to: ‘instacart-market-basket-analysis.zip’

instacart-market-ba 100%[===================>] 196.09M  16.6MB/s    in 12s

2020-09-30 16:21:38 (16.9 MB/s) - ‘instacart-market-basket-analysis.zip’ saved [205616541/205616541]

In [ ]:
!unzip instacart-market-basket-analysis.zip

Archive:  instacart-market-basket-analysis.zip
   creating: instacart-market-basket-analysis/
  inflating: __MACOSX/._instacart-market-basket-analysis
  inflating: instacart-market-basket-analysis/order_products__prior.csv.zip
  inflating: __MACOSX/instacart-market-basket-analysis/._order_products__prior.csv.zip
  inflating: instacart-market-basket-analysis/.DS_Store
  inflating: __MACOSX/instacart-market-basket-analysis/._.DS_Store
  inflating: instacart-market-basket-analysis/order_products__train.csv.zip
  inflating: __MACOSX/instacart-market-basket-analysis/._order_products__train.csv.zip
  inflating: instacart-market-basket-analysis/aisles.csv.zip
  inflating: __MACOSX/instacart-market-basket-analysis/._aisles.csv.zip
  inflating: instacart-market-basket-analysis/orders.csv.zip
  inflating: __MACOSX/instacart-market-basket-analysis/._orders.csv.zip
  inflating: instacart-market-basket-analysis/departments.csv.zip
  inflating: __MACOSX/instacart-market-basket-analysis/._departments.csv.zip
  inflating: instacart-market-basket-analysis/products.csv.zip
  inflating: __MACOSX/instacart-market-basket-analysis/._products.csv.zip

In [ ]:
%cd instacart-market-basket-analysis

/content/instacart-market-basket-analysis

In [ ]:
# Unzip all .csv.zip files in the directory
!unzip "*.zip"

Archive:  order_products__train.csv.zip
  inflating: order_products__train.csv
   creating: __MACOSX/
  inflating: __MACOSX/._order_products__train.csv

Archive:  departments.csv.zip
  inflating: departments.csv
  inflating: __MACOSX/._departments.csv

Archive:  aisles.csv.zip
  inflating: aisles.csv
  inflating: __MACOSX/._aisles.csv

Archive:  products.csv.zip
  inflating: products.csv
  inflating: __MACOSX/._products.csv

Archive:  orders.csv.zip
  inflating: orders.csv
  inflating: __MACOSX/._orders.csv

Archive:  order_products__prior.csv.zip
  inflating: order_products__prior.csv
  inflating: __MACOSX/._order_products__prior.csv

6 archives were successfully processed.

In [ ]:
# List all csv files in the current directory
# -l specifies the "long" listing format, which includes additional info on each file
# -h specifies "human readable" file size units
!ls -l -h *.csv

-rw-r--r-- 1 root root 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 root root  270 May  2  2017 departments.csv
-rw-r--r-- 1 root root 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 root root  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 root root 104M May  2  2017 orders.csv
-rw-r--r-- 1 root root 2.1M May  2  2017 products.csv

In [ ]:
display(example)

#### aisles

We don't need anything from aisles.csv

In [ ]:
aisles = pd.read_csv('aisles.csv')

print(aisles.shape)
aisles.head()

(134, 2)

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

#### departments

We don't need anything from departments.csv

In [ ]:
departments = pd.read_csv('departments.csv')

print(departments.shape)
departments.head()

(21, 2)

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

#### order_products__prior

We need:
- order id
- product id
- add to cart order

Everything except for 'reordered'

In [ ]:
order_products__prior = pd.read_csv('order_products__prior.csv')

print(order_products__prior.shape)
order_products__prior.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

#### order_products__train

We need:
- order id
- proudct id
- add to cart order

Everything except for 'reordered'

Do you see anything similar between order_products__train and order_products__prior?

In [ ]:
order_products__train = pd.read_csv('order_products__train.csv')

print(order_products__train.shape)
order_products__train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

#### orders

We need:
- order id
- user id
- order number
- order dow
- order hour of day

In [ ]:
orders = pd.read_csv('orders.csv')

print(orders.shape)
orders.head()

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

#### products

We need:
- product id
- product name

In [ ]:
products = pd.read_csv('products.csv')

print(products.shape)
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

#### Concatenate order_products__prior and order_products__train

In [ ]:
order_products = pd.concat([order_products__prior, order_products__train])

order_products.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [ ]:
print(order_products__prior.shape)
print(order_products__train.shape)

(32434489, 4)
(1384617, 4)

In [ ]:
print(order_products.shape)

(33819106, 4)

### Key Point(s)

Concatenating dataframes means to stick two dataframes together either by rows or by columns. The default behavior of `pd.concat()` is to take the rows of one dataframe and add them to the rows of another dataframe. If we pass the argument `axis=1` then we will be adding the columns of one dataframe to the columns of another dataframe.

Concatenating dataframes is most useful when the columns are the same between two dataframes or when we have matching row indices between two dataframes. 

Be ready to use this method to combine dataframes together during your assignment.

## Merging Dataframes with Pandas

In [ ]:
display(example)

Before we can continue we need to understand where the data in the above table is coming from and what why specific pieces of data are held in the specific dataframes.

Each of these CSVs has a specific unit of observation (row). The columns that we see included in each CSV were selected purposefully. For example, everything each row of the `orders` dataframe is a specific and unique order -telling us who made the order, and when they made it. Every row in the `products` dataframe tells us about a specific and unique product that thestore offers. And everything in the `order_products` dataframe tells us about how products are associated with specific orders -including when the product was added to the shopping cart. 

### The Orders Dataframe

Holds information about specific orders, things like who placed the order, what 

- user_id
- order_id
- order_number
- order_dow
- order_hour_of_day

### The Products Dataframe

Holds information about individual products.

- product_id
- product_name

### The Order_Products Dataframe

Tells us how products are associated with specific orders since an order is a group of products.

- order_id
- product_id
- add_to_cart_order

As we look at the table that we're trying to recreate, we notice that we're not looking at specific orders or products, but at a specific **USER**. We're looking at the first two orders for a specific user and the products associated with those orders, so we'll need to combine dataframes to get all of this data together into a single table.

**The key to combining all of this information is that we need values that exist in both datasets that we can use to match up rows and combine dataframes.**

### Let's Try It Out
We have two dataframes, so we're going to need to merge our data twice. As we approach merging datasets together we will take the following approach.

1) Identify which to dataframes we would like to combine.

2) Find columns that are common between both dataframes that we can use to match up information.

3) Slim down both of our dataframes so that they only relevant data before we merge.

4) Merge the dataframes.

In [ ]:
merge_one = pd.merge(order_products, orders, how='inner', on='order_id')

merge_one.head()

   order_id  product_id  ...  order_hour_of_day  days_since_prior_order
0         2       33120  ...                  9                     8.0
1         2       28985  ...                  9                     8.0
2         2        9327  ...                  9                     8.0
3         2       45918  ...                  9                     8.0
4         2       30035  ...                  9                     8.0

[5 rows x 10 columns]

In [ ]:
all_info = pd.merge(merge_one, products, how='inner', on='product_id')

all_info.head()

   order_id  product_id  ...  aisle_id  department_id
0         2       33120  ...        86             16
1        26       33120  ...        86             16
2       120       33120  ...        86             16
3       327       33120  ...        86             16
4       390       33120  ...        86             16

[5 rows x 13 columns]

#### ^^^^^ DON'T DO THIS!

I just merged absolutely everything

In [ ]:
## all_info2 = pd.merge(merge_one, )

#### First Merge

1) Combine `orders` and `order_products`

2) We will use the `order_id` column to match information between the two datasets

3) Lets slim down our dataframes to only the information that we need. We do this because the merge process is complex. Why would we merge millions of rows together if we know that we're only going to need 11 rows when we're done

What specific conditions could we use to slim down the `orders` dataframe?

`user_id == 1` and `order_id <=2`

or

`order_id == 2539329` and `order_id == 2398795`

In [ ]:
# An example of dataframe filtering

# Create a condition
condition = orders['order_id'] <=5

# Pass that condition into the square brackets 
# that we use to access portions of a dataframe
# only the rows where that condition evaluates to *TRUE*
# will be retained in the dataframe

# Look at the subsetted dataframe
orders[condition]

         order_id  user_id  ... order_hour_of_day  days_since_prior_order
1868044         1   112108  ...                10                     9.0
2593373         5   156122  ...                16                     9.0
2958007         4   178520  ...                 9                     7.0
3355525         2   202279  ...                 9                     8.0
3417191         3   205970  ...                17                    12.0

[5 rows x 7 columns]

In [ ]:
display(example)

In [ ]:
# We don't necessarily have to save our condition to the variable "condition"
# we can pass the condition into the square bracket directly
# I just wanted to be clear what was happening inside of the square brackets

orders[(orders['order_id'] <=5)]

# orders[0:10,0:5]

         order_id  user_id  ... order_hour_of_day  days_since_prior_order
1868044         1   112108  ...                10                     9.0
2593373         5   156122  ...                16                     9.0
2958007         4   178520  ...                 9                     7.0
3355525         2   202279  ...                 9                     8.0
3417191         3   205970  ...                17                    12.0

[5 rows x 7 columns]

In [ ]:
orders['user_id'] == 1

0           True
1           True
2           True
3           True
4           True
           ...
3421078    False
3421079    False
3421080    False
3421081    False
3421082    False
Name: user_id, Length: 3421083, dtype: bool

In [ ]:
orders['order_number'] <= 2

0           True
1           True
2          False
3          False
4          False
           ...
3421078    False
3421079    False
3421080    False
3421081    False
3421082    False
Name: order_number, Length: 3421083, dtype: bool

In [ ]:
# Filter based on user_id and order_number
# AND condition version 
# I need to use the "bitwise" and operator: &

condition = (orders['user_id'] == 1) & (orders['order_number'] <= 5)

orders_subset = orders[condition]

orders_subset

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0

[2 rows x 7 columns]

Remember there are multiple ways that we could have filtered this dataframe. We also could have done it by specific `order_id`s

In [ ]:
# use the bitwise "or" operator: |

condition = (orders['order_id'] == 2539329) | (orders['order_id'] == 2398795)

orders_subset = orders[condition]

orders_subset

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0

[2 rows x 7 columns]

Now we'll filter down the order_products dataframe

What conditions could we use for subsetting that table?

We can use order_id again.

In [ ]:
condition = (order_products['order_id'] == 2539329) | (order_products['order_id'] == 2398795)

order_products_subset = order_products[condition]

order_products_subset

          order_id  product_id  add_to_cart_order  reordered
22742744   2398795         196                  1          1
22742745   2398795       10258                  2          0
22742746   2398795       12427                  3          1
22742747   2398795       13176                  4          0
22742748   2398795       26088                  5          1
22742749   2398795       13032                  6          0
24076664   2539329         196                  1          0
24076665   2539329       14084                  2          0
24076666   2539329       12427                  3          0
24076667   2539329       26088                  4          0
24076668   2539329       26405                  5          0

4) Now we're ready to merge these two tables together.

In [ ]:
orders_and_products = pd.merge(orders_subset, order_products_subset, on='order_id')

orders_and_products

    order_id  user_id eval_set  ...  product_id  add_to_cart_order  reordered
0    2539329        1    prior  ...         196                  1          0
1    2539329        1    prior  ...       14084                  2          0
2    2539329        1    prior  ...       12427                  3          0
3    2539329        1    prior  ...       26088                  4          0
4    2539329        1    prior  ...       26405                  5          0
5    2398795        1    prior  ...         196                  1          1
6    2398795        1    prior  ...       10258                  2          0
7    2398795        1    prior  ...       12427                  3          1
8    2398795        1    prior  ...       13176                  4          0
9    2398795        1    prior  ...       26088                  5          1
10   2398795        1    prior  ...       13032                  6          0

[11 rows x 10 columns]

In [ ]:
display(example)

In [ ]:
# Remove columns that we don't need

uneeded_cols = ['eval_set', 'days_since_prior_order', 'add_to_cart_order', 'reordered']

# orders_and_products.drop(uneeded_cols, inplace=True, axis=1)

orders_and_products

    order_id  user_id  order_number  order_dow  order_hour_of_day  product_id
0    2539329        1             1          2                  8         196
1    2539329        1             1          2                  8       14084
2    2539329        1             1          2                  8       12427
3    2539329        1             1          2                  8       26088
4    2539329        1             1          2                  8       26405
5    2398795        1             2          3                  7         196
6    2398795        1             2          3                  7       10258
7    2398795        1             2          3                  7       12427
8    2398795        1             2          3                  7       13176
9    2398795        1             2          3                  7       26088
10   2398795        1             2          3                  7       13032

Okay, we're looking pretty good, we're missing one more column `product_name` so we're going to need to merge one more time

1) merge `orders_and_products` with `products`

2) Use `product_id` as our identifier in both tables

3) We need to slim down the `products` dataframe

In [ ]:
condition = products['product_id'].isin(orders_and_products['product_id'])

products_subset = products[condition]

products_subset

       product_id  ... department_id
195           196  ...             7
10257       10258  ...            19
12426       12427  ...            19
13031       13032  ...            14
13175       13176  ...             4
14083       14084  ...            16
26087       26088  ...            19
26404       26405  ...            17

[8 rows x 4 columns]

In [ ]:
final = pd.merge(products_subset, orders_and_products, on='')

In [ ]:
display(example)

#### Some nitpicky cleanup:

In [ ]:
# sort rows

In [ ]:
# reorder columns
final = final[['user_id', 'order_id', 'order_number','order_dow', 'order_hour_of_day', 'add_to_cart_order', 'product_id', 'product_name']]

final

In [ ]:
# remove underscores from column headers

# remove underscores from column headers

In [ ]:
display(example)

### Challenge

Review this Chis Albon documentation about [concatenating dataframes by row and by column](https://chrisalbon.com/python/data_wrangling/pandas_join_merge_dataframe/) and then be ready to master this function and practice using different `how` parameters on your assignment.

## Tidy Data Format

### What is the Tidy Data Format?

In 2014, Hadley Wickham published an awesome paper named Tidy Data, that describes the process of tidying a dataset in R.

#### Conditions of Tidy Data

1. Each variable must have its own column.
2. Each observation must have its own row.

![Tidy Data Diagrams](https://miro.medium.com/max/700/1*7jjzhy4KknPz9hJVnC_w7w.png)

> A helpful mindset for determining whether your data are tidy is to think backwards from the plot you want to draw. From this perspective, a “variable” is something that will be assigned a role in the plot."

### Why reshape data?

- Some libraries prefer data in different formats

For example, the Seaborn data visualization library prefers data in "Tidy" format often (but not always).

> "[Seaborn will be most powerful when your datasets have a particular organization.](https://seaborn.pydata.org/introduction.html#organizing-datasets) This format ia alternately called “long-form” or “tidy” data and is described in detail by Hadley Wickham. The rules can be simply stated:

### Hadley Wickham's Examples

From his paper, [Tidy Data](http://vita.had.co.nz/papers/tidy-data.html)

In [ ]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

"Table 1 provides some data about an imaginary experiment in a format commonly seen in the wild. 

The table has two columns and three rows, and both rows and columns are labelled."

In [ ]:
table1

"There are many ways to structure the same underlying data. 

Table 2 shows the same data as Table 1, but the rows and columns have been transposed. The data is the same, but the layout is different."

In [ ]:
# When we swap rows and columns we call that "transposing"

"Table 3 reorganises Table 1 to make the values, variables and obserations more clear.

Table 3 is the tidy version of Table 1. Each row represents an observation, the result of one treatment on one person, and each column is a variable."

| name         | trt | result |
|--------------|-----|--------|
| John Smith   | a   | -      |
| Jane Doe     | a   | 16     |
| Mary Johnson | a   | 3      |
| John Smith   | b   | 2      |
| Jane Doe     | b   | 11     |
| Mary Johnson | b   | 1      |

### Let's Try It Out

#### Table 1 --> Tidy

We can use the pandas `melt` function to reshape Table 1 into Tidy format.

In [ ]:
table1

In [ ]:
# Take the row index, and add it as a new column

In [ ]:
# What is the unique identifier for each row
# Where is the data at that I want to be in my single "tidy" column

In [ ]:
# rename columns

#### Tidy --> Table 1

The `pivot_table` function is the inverse of `melt`.

In [ ]:
# index: unique identifier
# columns: What do you want to differentiate the columns in wide format
# values: Where are the numbers at - go in the middle of the wide dataframe

### Challenge

On your assignment, be prepared to take table2 (the transpose of table1) and reshape it to be in tidy data format using `.melt()` and then put it back in "wide format" using `.pivot_table()`

## Transition between tidy and wide data formats with `.melt()` and `.pivot()`.

Tidy data format can be particularly useful with certain plotting libraries like Seaborn for example. Lets practice reshaping our data and show how this can be extremely useful in preparing our data for plotting.

Remember that tidy data format means:

- Each variable is a column
- Each observation is a row

A helpful mindset for determining whether your data are tidy is to think backwards from the plot you want to draw. From this perspective, a “variable” is something that will be assigned a role in the plot." When plotting, this typically means that the values that we're most interested in and that represent the same thing will all be in a single column. You'll see that in the different examples that we show. The important data will be in a single column.

In [ ]:
# Look at some of the awesome out-of-the-box seaborn functionality:

import seaborn as sns

sns.catplot(x='trt', y='result', col='name', kind='bar', data=tidy1, height=4);

### Let's Try It Out

Now with Instacart Data. We're going to try and reproduce a small part of this visualization:

In [ ]:
from IPython.display import display, Image
url = 'https://cdn-images-1.medium.com/max/1600/1*wKfV6OV-_1Ipwrl7AjjSuw.png'
example = Image(url=url, width=600)

display(example)

Instead of a plot with 50 products, we'll just do two — the first products from each list
- Half And Half Ultra Pasteurized
- Half Baked Frozen Yogurt

So, given a `product_name` we need to calculate its `order_hour_of_day` pattern.

In [ ]:
products = pd.read_csv('products.csv')

order_products = pd.concat([pd.read_csv('order_products__prior.csv'), 
                            pd.read_csv('order_products__train.csv')])

orders = pd.read_csv('orders.csv')

#### Subset and Merge

One challenge of performing a merge on this data is that the `products` and `orders` datasets do not have any common columns that we can merge on. Due to this we will have to use the `order_products` dataset to provide the columns that we will use to perform the merge.

Here's the two products that we want to work with.

In [ ]:
product_names = ['Half Baked Frozen Yogurt', 'Half And Half Ultra Pasteurized']

Lets remind ourselves of what columns we have to work with:

In [ ]:
orders.columns.to_list()

In [ ]:
display(example)

This might blow your mind, but we're going to subset the dataframes to select specific columns **and** merge them all in one go. Ready?

Ok, so we were a little bit lazy and probably should have subsetted our the rows of our dataframes before we merged them. We are going to filter after the fact. This is something that you can try out for practice. Can you figure out how to filter these dataframes **before** merging rather than after?

In [ ]:
product_names = ['Half Baked Frozen Yogurt', 'Half And Half Ultra Pasteurized']

Again, there are multiple effective ways to write conditions.

In [ ]:
condition = ((merged['product_name']=='Half Baked Frozen Yogurt') | 
             (merged['product_name']=='Half And Half Ultra Pasteurized'))

#### 4 ways to reshape and plot

In [ ]:
display(example)

1) The `.value_counts()` approach.

Remember, that we're trying to get the key variables (values) listed as a single column.

In [ ]:
froyo = subset[subset['product_name']=='Half Baked Frozen Yogurt']
cream = subset[subset['product_name']=='Half And Half Ultra Pasteurized']

In [ ]:
cream['order_hour_of_day'].value_counts(normalize=True).sort_index()

In [ ]:
froyo['order_hour_of_day'].value_counts(normalize=True).sort_index()

In [ ]:
import matplotlib.pyplot as plt

(cream['order_hour_of_day'].value_counts(normalize=True).sort_index()
 .plot())
(froyo['order_hour_of_day'].dvalue_counts(normalize=True).sort_index()
 .plot());

In [ ]:
display(example)

2) Crosstab

3) Pivot Table

4) Melt 

We've got to get it into wide format first. We'll use a crosstab which is a specific type of pivot_table.

Now, with Seaborn:

In [ ]:
sns.relplot(x='Hour of Day Ordered', 
            y='Percent of Orders by Product', 
            hue='Product',
            data=melted,
            kind='line');